---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeConstraintDiameter
source: html/29b74411-e152-0b54-3513-9267310af4e2.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintDiameter

A diameter constraint associated with an arc in a RebarShapeDefinition.

## Syntax (C#)
```csharp
public class RebarShapeConstraintDiameter : RebarShapeConstraint
```